Tasks/ЗадачаПоОбработкеДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>ЗадачаПоОбработкеДокумента</Name>
			<Addressing>InformationRegister.ИсполнителиЗадач</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание постановки задачи для исполнителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Comment>Предмет задачи</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятаКИсполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКИсполнению</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительНазначенПринудительно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Comment>Описание результата выполнения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прервана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоставПодписи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодписанныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыполненаИзЗаОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Comment>Описание ошибки в результате выполнения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Comment>Плановый срок выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполненияФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентныйИнтервал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеИнтервалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредметаСтрокой</Name>
					<Comment>Используется для сортировки по типу в формах списков задач</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокНапоминанияОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтсчетаПредельногоСрокаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Предшественники</Name>
					<Comment>При отмене выполнения задачи-предшественника требуется прервать все задачи-последователи</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПредшественник</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ЗадачаПоОбработкеДокумента/Forms/ЗадачиДляНазначенияИсполнителей/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьОтбор(Новый Структура("ПоказыватьВыполненные", ПоказыватьВыполненные));
	
	// Установка отбора динамического списка.
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ПометкаУдаления", Ложь, ВидСравненияКомпоновкиДанных.Равно, , ,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "Исполнитель", Пользователи.ТекущийПользователь());
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяДата", ТекущаяДатаСеанса());
	
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "ТипДокумента", , Истина);
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "Предмет", , , Истина, Истина);
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "Ссылка.Предмет", Истина, Истина, Истина, Истина, Истина, Истина, Истина, Истина);
	
	ИнициализацияКомандИсполнителейЗадач();
	
	ПроцессыОбработкиДокументов.ДобавитьДополнительныеКолонкиСпискаЗадач(ЭтотОбъект, "Список");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	СгруппироватьПоКолонкеНаСервере(Настройки["РежимГруппировки"]);
	УстановитьОтбор(Настройки);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ЗадачаПоОбработкеДокумента" Тогда
		ОбновитьСписокЗадачНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьВыполненныеПриИзменении(Элемент)
	УстановитьОтбор(Новый Структура("ПоказыватьВыполненные", ПоказыватьВыполненные));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	УправлениеВидимостьюКоманд(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "Предмет") Тогда
		ПоказатьЗначение(,ТекущиеДанные.Предмет);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгруппироватьПоБезГруппировки(Команда)
	СгруппироватьПоКолонке("");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоАвтору(Команда)
	СгруппироватьПоКолонке("Автор");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоПредмету(Команда)
	СгруппироватьПоКолонке("ТипДокумента");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоЭтапу(Команда)
	СгруппироватьПоКолонке("Этап");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗадач(Команда)
	
	ОбновитьСписокЗадачНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьИсполнителей()
	
	КлючиПоиска = Новый Массив;
	
	Для Каждого Задача Из Элементы.Список.ВыделенныеСтроки Цикл
		Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		ДанныеЗадачи = Элементы.Список.ДанныеСтроки(Задача);
		Если ДанныеЗадачи.Выполнена Тогда
			Прервать;
		КонецЕсли;
		
		КлючУжеЕсть = Ложь;
		Для Каждого КлючПоиска Из КлючиПоиска Цикл
			Если КлючПоиска.РольИсполнителя = ДанныеЗадачи.РольИсполнителя
				И КлючПоиска.ОсновнойОбъектАдресации = ДанныеЗадачи.ОсновнойОбъектАдресации
				И КлючПоиска.ДополнительныйОбъектАдресации = ДанныеЗадачи.ДополнительныйОбъектАдресации Тогда
				КлючУжеЕсть = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ КлючУжеЕсть Тогда
			КлючПоиска = Новый Структура;
			КлючПоиска.Вставить("РольИсполнителя", ДанныеЗадачи.РольИсполнителя);
			КлючПоиска.Вставить("ОсновнойОбъектАдресации", ДанныеЗадачи.ОсновнойОбъектАдресации);
			КлючПоиска.Вставить("ДополнительныйОбъектАдресации", ДанныеЗадачи.ДополнительныйОбъектАдресации);
			КлючиПоиска.Добавить(КлючПоиска);
		КонецЕсли;
		
	КонецЦикла;
	
	МассивВидимыхКнопок = Новый Массив;
	
	Для Каждого КлючПоиска Из КлючиПоиска Цикл
		Для Каждого ИсполнительЗадачи Из ИсполнителиЗадач Цикл
			Если КлючПоиска.РольИсполнителя = ИсполнительЗадачи.РольИсполнителя
				И (КлючПоиска.ОсновнойОбъектАдресации = ИсполнительЗадачи.ОсновнойОбъектАдресации
				ИЛИ НЕ ЗначениеЗаполнено(КлючПоиска.ОсновнойОбъектАдресации) И НЕ ЗначениеЗаполнено(ИсполнительЗадачи.ОсновнойОбъектАдресации))
				И (КлючПоиска.ДополнительныйОбъектАдресации = ИсполнительЗадачи.ДополнительныйОбъектАдресации
				ИЛИ НЕ ЗначениеЗаполнено(КлючПоиска.ДополнительныйОбъектАдресации) И НЕ ЗначениеЗаполнено(ИсполнительЗадачи.ДополнительныйОбъектАдресации)) Тогда
				
				ИмяКнопки = СписокКоманд.НайтиПоЗначению(ИсполнительЗадачи.Исполнитель).Представление;
				Если МассивВидимыхКнопок.Найти(ИмяКнопки) = Неопределено Тогда
					МассивВидимыхКнопок.Добавить(ИмяКнопки);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Команда Из СписокКоманд Цикл
		Если МассивВидимыхКнопок.Найти(Команда.Представление) <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Команда.Представление, "Видимость", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Команда.Представление+"СписокКонтекстноеМеню", "Видимость", Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Команда.Представление, "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Команда.Представление+"СписокКонтекстноеМеню", "Видимость", Ложь);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаДляВыводаВПустоеПодменю", "Видимость", МассивВидимыхКнопок.Количество() = 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокКонтекстноеМенюКомандаДляВыводаВПустоеПодменю", "Видимость", МассивВидимыхКнопок.Количество() = 0);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НазначитьИсполнителя(Команда)
	
	Для Каждого КомандаИсполнитель Из СписокКоманд Цикл
		Если СтрНайти(Команда.Имя, КомандаИсполнитель.Представление) > 0 Тогда
			Исполнитель = КомандаИсполнитель.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПроцессыОбработкиДокументовКлиент.НазначитьИсполнителя(Элементы.Список.ВыделенныеСтроки, Исполнитель);
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьНазначениеИсполнителя(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ОтменитьНазначениеИсполнителя(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ПроцессыОбработкиДокументов.УстановитьОформлениеЗадач(Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоКолонке(Знач ИмяКолонкиРеквизита)
	
	Для Каждого ЭлементНастроек Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("СтруктураНастроекКомпоновкиДанных") И ЭлементНастроек.Структура.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Пользовательская настройки группировки будет удалена. Продолжить?'");
			Обработчик = Новый ОписаниеОповещения("ПродолжитьГруппировкуПоКолонкеПослеВопроса", ЭтотОбъект, ИмяКолонкиРеквизита);
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьГруппировкуПоКолонкеПослеВопроса(Результат, ИмяКолонкиРеквизита) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементНастроек Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("СтруктураНастроекКомпоновкиДанных") Тогда
			ЭлементНастроек.Структура.Очистить();
		КонецЕсли;
	КонецЦикла;
	
	ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита)
	
	РежимГруппировки = ИмяКолонкиРеквизита;
	Список.Группировка.Элементы.Очистить();
	Если НЕ ПустаяСтрока(ИмяКолонкиРеквизита) Тогда
		ПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиРеквизита);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СгруппироватьПоКолонкеНаСервере(Знач ИмяКолонкиРеквизита)
	РежимГруппировки = ИмяКолонкиРеквизита;
	Список.Группировка.Элементы.Очистить();
	Если НЕ ПустаяСтрока(ИмяКолонкиРеквизита) Тогда
		ПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиРеквизита);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗадачНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяДата", ТекущаяДатаСеанса());
	
	Элементы.Список.Обновить();
	
	ИнициализацияКомандИсполнителейЗадач();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(ПараметрыОтбора)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Выполнена");
	Если НЕ ПараметрыОтбора["ПоказыватьВыполненные"] Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Выполнена", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияКомандИсполнителейЗадач()
	
	СписокКоманд.Очистить();
	
	ИменаКоманд = "";
	МассивКомандКУдалению = Новый Массив;
	МассивКнопокКУдалению = Новый Массив;
	Для Каждого КомандаФормы Из Команды Цикл
		Если КомандаФормы.Действие = "Подключаемый_НазначитьИсполнителя" Тогда
			ИменаКоманд = ИменаКоманд + КомандаФормы.Имя;
			МассивКомандКУдалению.Добавить(КомандаФормы);
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей = РеквизитФормыВЗначение("ИсполнителиЗадач");
	НаборЗаписей.Прочитать();
	ЗначениеВРеквизитФормы(НаборЗаписей, "ИсполнителиЗадач");
	
	МассивИсполнителей = НаборЗаписей.ВыгрузитьКолонку("Исполнитель");
	МассивИсполнителей = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивИсполнителей);
	
	СписокДляСортировки = Новый СписокЗначений;
	СписокДляСортировки.ЗагрузитьЗначения(МассивИсполнителей);
	СписокДляСортировки.СортироватьПоЗначению();
	
	МассивИсполнителей = СписокДляСортировки.ВыгрузитьЗначения();
	Для Каждого Исполнитель Из МассивИсполнителей Цикл
		
		ИмяКоманды = "НазначитьИсполнителя" + СтрЗаменить(XMLСтрока(Исполнитель), "-", "_");
		
		КомандаФормы = Команды.Найти(ИмяКоманды);
		Если КомандаФормы = Неопределено Тогда
			
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие = "Подключаемый_НазначитьИсполнителя";
			НоваяКоманда.Заголовок = Строка(Исполнитель);
			
			НоваяКнопка = Элементы.Добавить(ИмяКоманды,
											Тип("КнопкаФормы"),
											Элементы.ГруппаНазначитьИсполнителя);
			НоваяКнопка.Видимость = Ложь;
			НоваяКнопка.ИмяКоманды = ИмяКоманды;
			
			НоваяКнопка = Элементы.Добавить(ИмяКоманды+"СписокКонтекстноеМеню",
											Тип("КнопкаФормы"),
											Элементы.СписокКонтекстноеМенюГруппаНазначитьИсполнителя);
			НоваяКнопка.Видимость = Ложь;
			НоваяКнопка.ИмяКоманды = ИмяКоманды;
			
		Иначе
			// эту команду не нужно удалять
			ИндексКоманды = МассивКомандКУдалению.Найти(КомандаФормы);
			Если ИндексКоманды <> Неопределено Тогда
				МассивКомандКУдалению.Удалить(ИндексКоманды);
				ИменаКоманд = СтрЗАменить(ИменаКоманд, ИмяКоманды, "");
			КонецЕсли;
			
		КонецЕсли;
		
		СписокКоманд.Добавить(Исполнитель, ИмяКоманды);
		
	КонецЦикла;
	
	Если ИменаКоманд = "" Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы")
			И Элемент.ИмяКоманды <> ""
			И СтрНайти(ИменаКоманд, Элемент.ИмяКоманды) > 0 Тогда
			МассивКнопокКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КнопкаФормы Из МассивКнопокКУдалению Цикл
		Элементы.Удалить(КнопкаФормы);
	КонецЦикла;
	Для Каждого КомандаФормы Из МассивКомандКУдалению Цикл
		Команды.Удалить(КомандаФормы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКоманд(ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено
		И (ТекущиеДанные.Свойство("ИсполнительНазначенПринудительно")
				И ТекущиеДанные.ИсполнительНазначенПринудительно
			ИЛИ ТекущиеДанные.Свойство("ПринятаКИсполнению")
				И ТекущиеДанные.ПринятаКИсполнению)
		И ТекущиеДанные.Свойство("Выполнена")
		И НЕ ТекущиеДанные.Выполнена Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтменитьНазначениеИсполнителя", "Доступность", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокКонтекстноеМенюОтменитьНазначениеИсполнителя", "Доступность", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтменитьНазначениеИсполнителя", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокКонтекстноеМенюОтменитьНазначениеИсполнителя", "Доступность", Ложь);
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбновитьИсполнителей");
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИсполнителей", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти
